wentbackward/esp32_do_it/sdkconfig.defaults.esp32s3_rgb
# Board: ESP32-S3 + RGB 800x480 Panel + I2C GT911
# To use: idf.py -D SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.esp32s3_rgb" build

# Display driver selection
CONFIG_APP_DISPLAY_RGB_PARALLEL=y
CONFIG_IDF_TARGET="esp32s3"

# Display resolution
CONFIG_APP_LCD_HRES=800
CONFIG_APP_LCD_VRES=480
CONFIG_APP_LCD_COLOR_DEPTH=16

# Display common settings
CONFIG_APP_LCD_BGR=y
CONFIG_APP_LCD_INVERT_DEFAULT=n
CONFIG_APP_LCD_SWAP_BYTES=n

# Backlight (Elecrow V3.0 uses GPIO 2 for TFT_BL)
CONFIG_APP_LCD_PIN_BL=2
CONFIG_APP_LCD_BL_PWM_ENABLE=y
CONFIG_APP_LCD_BL_PWM_FREQ_HZ=5000
CONFIG_APP_LCD_BL_PWM_RESOLUTION=10
CONFIG_APP_LCD_BL_DEFAULT_DUTY=80

# RGB parallel display settings
CONFIG_APP_LCD_RGB_PCLK_HZ=15000000
CONFIG_APP_LCD_RGB_PIN_PCLK=0
CONFIG_APP_LCD_RGB_PIN_HSYNC=39
CONFIG_APP_LCD_RGB_PIN_VSYNC=41
CONFIG_APP_LCD_RGB_PIN_DE=40
CONFIG_APP_LCD_RGB_PIN_D0=8
CONFIG_APP_LCD_RGB_PIN_D1=3
CONFIG_APP_LCD_RGB_PIN_D2=46
CONFIG_APP_LCD_RGB_PIN_D3=9
CONFIG_APP_LCD_RGB_PIN_D4=1
CONFIG_APP_LCD_RGB_PIN_D5=5
CONFIG_APP_LCD_RGB_PIN_D6=6
CONFIG_APP_LCD_RGB_PIN_D7=7
CONFIG_APP_LCD_RGB_PIN_D8=15
CONFIG_APP_LCD_RGB_PIN_D9=16
CONFIG_APP_LCD_RGB_PIN_D10=4
CONFIG_APP_LCD_RGB_PIN_D11=45
CONFIG_APP_LCD_RGB_PIN_D12=48
CONFIG_APP_LCD_RGB_PIN_D13=47
CONFIG_APP_LCD_RGB_PIN_D14=21
CONFIG_APP_LCD_RGB_PIN_D15=14

# RGB timing settings
CONFIG_APP_LCD_RGB_HSYNC_POLARITY=0
CONFIG_APP_LCD_RGB_HSYNC_FRONT_PORCH=8
CONFIG_APP_LCD_RGB_HSYNC_PULSE_WIDTH=4
CONFIG_APP_LCD_RGB_HSYNC_BACK_PORCH=43
CONFIG_APP_LCD_RGB_VSYNC_POLARITY=0
CONFIG_APP_LCD_RGB_VSYNC_FRONT_PORCH=8
CONFIG_APP_LCD_RGB_VSYNC_PULSE_WIDTH=4
CONFIG_APP_LCD_RGB_VSYNC_BACK_PORCH=12
CONFIG_APP_LCD_RGB_PCLK_ACTIVE_NEG=1
CONFIG_APP_LCD_RGB_DE_IDLE_HIGH=0
CONFIG_APP_LCD_RGB_PCLK_IDLE_HIGH=0

# Touch driver selection
CONFIG_APP_TOUCH_GT911_I2C=y

# Touch I2C settings
CONFIG_APP_TOUCH_I2C_PORT=0
CONFIG_APP_TOUCH_PIN_SCL=20
CONFIG_APP_TOUCH_PIN_SDA=19
CONFIG_APP_TOUCH_I2C_CLOCK_HZ=400000
CONFIG_APP_TOUCH_I2C_ADDR=0x5D
CONFIG_APP_TOUCH_PIN_RST=-1
CONFIG_APP_TOUCH_MANUAL_RESET=n
CONFIG_APP_TOUCH_USE_INT_PIN=n

# Rotation
CONFIG_APP_ROT_SWAP_XY=0
CONFIG_APP_ROT_MIRROR_X=0
CONFIG_APP_ROT_MIRROR_Y=0

# ESP32-S3 CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# PSRAM configuration for RGB panel (requires large framebuffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n

# LVGL memory: use C library malloc for PSRAM boards
# This allows LVGL to dynamically use all available PSRAM (~8 MB) instead of a fixed 128 KB pool.
# ESP-IDF's malloc automatically places large allocations (>16 KB) in PSRAM and
# small/critical allocations in internal RAM (CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384).
# No need to tune LV_MEM_SIZE - LVGL uses as much memory as needed from available PSRAM.
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"                                                   
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_APP_LVGL_BUF_LINES=40

# ESPTOOLPY settings
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=5

# HID mode (disabled by default - uncomment to enable)
# WARNING: ESP32-S3 USB uses GPIO 19/20 for D+/D-. This board uses GPIO 19/20 for touch I2C.
# To use HID mode, you must reconfigure touch I2C to different pins or disable touch.
# Note: HID modes replace standard UI modes. Only one can be active.

# Trackpad mode - Touch panel acts as USB mouse
# CONFIG_APP_HID_MODE_TRACKPAD=y
# CONFIG_APP_UI_TRACKPAD=y
# CONFIG_APP_HID_TRACKPAD_SENSITIVITY=2
# CONFIG_APP_HID_TRACKPAD_TAP_THRESHOLD_MS=200

# Macropad mode - Button grid sends keyboard keys
# CONFIG_APP_HID_MODE_MACROPAD=y
# CONFIG_APP_UI_MACROPAD=y
# CONFIG_APP_HID_MACROPAD_ROWS=3
# CONFIG_APP_HID_MACROPAD_COLS=4

# Gamepad mode - D-pad and action buttons as USB gamepad
# CONFIG_APP_HID_MODE_GAMEPAD=y
# CONFIG_APP_UI_GAMEPAD=y
# CONFIG_APP_HID_GAMEPAD_BUTTON_COUNT=4

